
def requirements_definition_from_text(text: str) -> str:
    """テキストをインプットに、要求定義を生成する
    """
    return text + '''テキストボックスの値を入力としてAIに渡して結果を出力する
テキストボックスの値を入力としてAIに渡して結果を出力するテキストボックスの値を入力としてAIに渡して結果を出力する
テキストボックスの値を入力としてAIに渡して結果を出力するテキストボックスの値を入力としてAIに渡して結果を出力する
テキストボックスの値を入力としてAIに渡して結果を出力するテキストボックスの値を入力としてAIに渡して結果を出力する
テキストボックスの値を入力としてAIに渡して結果を出力するテキストボックスの値を入力としてAIに渡して結果を出力する
テキストボックスの値を入力としてAIに渡して結果を出力するテキストボックスの値を入力としてAIに渡して結果を出力する
テキストボックスの値を入力としてAIに渡して結果を出力するテキストボックスの値を入力としてAIに渡して結果を出力する
        '''

def requirements_definition_from_file(file) -> str:
    """AIにテキスト入力を問い合わせる
    """
    input = file.read()
    return input + '''テキストボックスの値を入力としてAIに渡して結果を出力する
テキストボックスの値を入力としてAIに渡して結果を出力するテキストボックスの値を入力としてAIに渡して結果を出力する
テキストボックスの値を入力としてAIに渡して結果を出力するテキストボックスの値を入力としてAIに渡して結果を出力する
テキストボックスの値を入力としてAIに渡して結果を出力するテキストボックスの値を入力としてAIに渡して結果を出力する
テキストボックスの値を入力としてAIに渡して結果を出力するテキストボックスの値を入力としてAIに渡して結果を出力する
テキストボックスの値を入力としてAIに渡して結果を出力するテキストボックスの値を入力としてAIに渡して結果を出力する
テキストボックスの値を入力としてAIに渡して結果を出力するテキストボックスの値を入力としてAIに渡して結果を出力する
        '''

def search(query: str) -> str:
    """AIにテキスト入力を問い合わせる
    """
    return query + '''テキストボックスの値を入力としてAIに渡して結果を出力する'''